#1
일자 = data.frame(일자=c("9월15일","9월18일","9월20일","9월30일","10월10일"))
차변계정 = data.frame(차변계정=c("감가상각누계액","보통예금","기부금","세금과공과","원재료"))
차변금액 = data.frame(차변금액=c(20000000,57500000,1300000,50000,300000))
대변계정 = data.frame(대변계정=c("차량운반구","외상매출금","제품","현금","현금"))
대변금액 = data.frame(대변금액=c(20000000,57500000,1300000,50000,300000))
전체분개 <- cbind(일자,차변계정,차변금액,대변계정,대변금액)
#2
전체분개[전체분개$차변계정 == '세금과공과',] ## 만약 , 앞뒤에 숫자가 다있으면 하나의 칸,셀 을 말하는거 지금은 roW
     ##열을 말하는거 ,뒤에 숫자가 없기 떄문에 $$다시 찾아보기 
sum(전체분개$대변금액[전체분개$대변계정 == '현금'])  
##알아서 반복 되는가보다 

#2
분개_2월9일 <- data.frame(일자="2월9일",차변계정="복리후생비",차변금액=5000000,대변계정="미지급금",대변금액=5000000)
분개_2월15일 <- data.frame(일자="2월15일",차변계정="보통예금",차변금액=550000,대변계정="대손충당금",대변금액=550000)
분개_2월24일 <- data.frame(일자="2월24일",차변계정="단기매매증권",차변금액=2000000,대변계정="현금",대변금액=2000000)
분개_3월2일 <- data.frame(일자="3월2일",차변계정="당좌예금",차변금액=5000000,대변계정="정기예금",대변금액=5000000)
분개_3월10일 <- data.frame(일자="3월10일",차변계정="임차보증금",차변금액=1000000,대변계정="현금",대변금액=1000000)
전체분개 <- rbind(분개_2월9일,분개_2월15일,분개_2월24일,분개_3월2일,분개_3월10일)

전체분개[전체분개$차변계정 == "당좌예금",]
sum(전체분개$대변금액[대변계정 == '현금'])