#My first R Project
#-1
보험료<-120000
선급보험료<-120000
cat(보험료,선급보험료,"\n")

#-2
#기말재고원가 200개\1000
기말재고<-200
단가<-1000
기말재고원가<-기말재고*단가

#당기판매가능액
기초재고자산<-100*1000
당기매입자산<-800*1000
당기판매가능액<-기초재고자산+당기매입자산

#매출원가
매출원가<-당기판매가능액-기말재고원가

cat('기말재고원가 = ',formatC(기말재고원가,format="f", big.mark=",",digits=0),"\n")
cat('매출원가 = ',formatC(매출원가,format="f", big.mark=",",digits=0),"\n")

#-3 
#총평균법 계산
#평균단가
재고량<-500
단가<-100+120
평균단가<-500/220

#기말재고원가
기말재고원가<-평균단가*140

#매출원가
기초재고자산<-100*100
당기매입자산<-400*120
판매가능액<-기초재고자산+당기매입자산
매출원가<-판매가능액-기말재고원가

cat('기말재고금액 = ',formatC(기말재고원가,format="f", big.mark=",",digits=0),"\n")
cat('매출원가 = ',formatC(매출원가,format="f", big.mark=",",digits=0),"\n")





